app/controllers/product_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    id = params[:id]
    @product = Product.find(id)

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    id = params[:id]
    @product = Product.find(id)

INSERT INTO "products" ("name", "description", "pricing", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Widget"], ["description", "Best widgets this side of vahalla"], ["pricing", 5.67], ["created_at", "2015-04-02 17:06:17.768058"], ["updated_at", "2015-04-02 17:06:17.768058"]]
---
  def create

    name = params[:name]
    description = params[:description]
    pricing = params[:pricing]

    product = Product.new
    product[:name] = name
    product[:description] = description
    product[:pricing] = pricing
    product.save

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 0]]
UPDATE "products" SET "pricing" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["pricing", nil], ["updated_at", "2015-04-02 15:18:53.526739"], ["id", 1]]
---
  def update
    # note - recommended to use integer field and then acts_as_dollars to conver 234 to 2.34
    id = params[:id]
    name = params[:name]
    description = params[:description]
    pricing = params[:pricing]
    # should be coming in as float from HTML5 number field.
    # pricing = '%.2f' % pricing.delete( "$" ).to_f

    product = Product.find(id)
    product[:name] = name
    product[:description] = description
    product[:pricing] = pricing

    puts ":::: prod: "+pricing.to_s

    if !product.valid? then
      flash[:alert] = product.errors.full_messages
    else
      product.save # assume no db errors right now